In [1]:
import pandas as pd

In [2]:
print(dir(pd))

['ArrowDtype', 'BooleanDtype', 'Categorical', 'CategoricalDtype', 'CategoricalIndex', 'DataFrame', 'DateOffset', 'DatetimeIndex', 'DatetimeTZDtype', 'ExcelFile', 'ExcelWriter', 'Flags', 'Float32Dtype', 'Float64Dtype', 'Grouper', 'HDFStore', 'Index', 'IndexSlice', 'Int16Dtype', 'Int32Dtype', 'Int64Dtype', 'Int8Dtype', 'Interval', 'IntervalDtype', 'IntervalIndex', 'MultiIndex', 'NA', 'NaT', 'NamedAgg', 'Period', 'PeriodDtype', 'PeriodIndex', 'RangeIndex', 'Series', 'SparseDtype', 'StringDtype', 'Timedelta', 'TimedeltaIndex', 'Timestamp', 'UInt16Dtype', 'UInt32Dtype', 'UInt64Dtype', 'UInt8Dtype', '__all__', '__builtins__', '__cached__', '__doc__', '__docformat__', '__file__', '__git_version__', '__loader__', '__name__', '__package__', '__path__', '__spec__', '__version__', '_built_with_meson', '_config', '_is_numpy_dev', '_libs', '_pandas_datetime_CAPI', '_pandas_parser_CAPI', '_testing', '_typing', '_version_meson', 'annotations', 'api', 'array', 'arrays', 'bdate_range', 'compat', 'concat', 'core', 'crosstab', 'cut', 'date_range', 'describe_option', 'errors', 'eval', 'factorize', 'from_dummies', 'get_dummies', 'get_option', 'infer_freq', 'interval_range', 'io', 'isna', 'isnull', 'json_normalize', 'lreshape', 'melt', 'merge', 'merge_asof', 'merge_ordered', 'notna', 'notnull', 'offsets', 'option_context', 'options', 'pandas', 'period_range', 'pivot', 'pivot_table', 'plotting', 'qcut', 'read_clipboard', 'read_csv', 'read_excel', 'read_feather', 'read_fwf', 'read_gbq', 'read_hdf', 'read_html', 'read_json', 'read_orc', 'read_parquet', 'read_pickle', 'read_sas', 'read_spss', 'read_sql', 'read_sql_query', 'read_sql_table', 'read_stata', 'read_table', 'read_xml', 'reset_option', 'set_eng_float_format', 'set_option', 'show_versions', 'test', 'testing', 'timedelta_range', 'to_datetime', 'to_numeric', 'to_pickle', 'to_timedelta', 'tseries', 'unique', 'util', 'value_counts', 'wide_to_long']

In [3]:
ser=pd.Series()

In [4]:
ser

Series([], dtype: object)

In [5]:
ser = pd.Series([23,45,76,87,91.9,44,99])  ## here we have notice the data type by printing the list
print(ser)

0    23.0
1    45.0
2    76.0
3    87.0
4    91.9
5    44.0
6    99.0
dtype: float64

In [6]:
ser=pd.Series([76,13.3,'67']) ## The data type here will print object as there is one string present in the series 
print(ser)

0      76
1    13.3
2      67
dtype: object

In [7]:
## How to create a dataframe

In [8]:
dict = {'A':[1, 2, 3, 4],'B':[5, 6, 7, 8],'C':[9, 10, 11, 12],'D':[13, 14, 15, 16]}   ## Create a dictionary

In [9]:
df = pd.DataFrame(dict)
print(df)

   A  B   C   D
0  1  5   9  13
1  2  6  10  14
2  3  7  11  15
3  4  8  12  16

In [10]:
df['Null']='0:0:0:0'.split(':')   ## Adding a new column in a dataframe
print(df)

   A  B   C   D Null
0  1  5   9  13    0
1  2  6  10  14    0
2  3  7  11  15    0
3  4  8  12  16    0

In [11]:
## How to create NaN values

In [12]:
import numpy as np
import pandas as pd

In [13]:
dict={'A':[3,4,np.nan],'B':[6,np.nan,np.nan],'C':[9,10,11]}     ## Here np.nan adds null values
dict

{'A': [3, 4, nan], 'B': [6, nan, nan], 'C': [9, 10, 11]}

In [14]:
df=pd.DataFrame(dict)
print(df)

     A    B   C
0  3.0  6.0   9
1  4.0  NaN  10
2  NaN  NaN  11

In [15]:
df['D']=[53,45,66]

In [16]:
print(df)

     A    B   C   D
0  3.0  6.0   9  53
1  4.0  NaN  10  45
2  NaN  NaN  11  66

In [17]:
## Dropping Nan values from Pandas

In [18]:
print(df.dropna(axis=1))       ## dropna() drops the null values from columns

    C   D
0   9  53
1  10  45
2  11  66

In [19]:
print(df.dropna(axis=0))    ## Drops null values from rows

     A    B  C   D
0  3.0  6.0  9  53

In [20]:
print(df)

     A    B   C   D
0  3.0  6.0   9  53
1  4.0  NaN  10  45
2  NaN  NaN  11  66

In [21]:
print(df.fillna(value=0))     ## Fills values in the place of NaN

     A    B   C   D
0  3.0  6.0   9  53
1  4.0  0.0  10  45
2  0.0  0.0  11  66

In [22]:
df.fillna(value=df['A'].mean(),inplace=True)              #inplace=True means we save our data for future
                                                        ## In place of NaN value, Mean of column A is filled

In [23]:
print(df)

     A    B   C   D
0  3.0  6.0   9  53
1  4.0  3.5  10  45
2  3.5  3.5  11  66

In [36]:
data={'Subject':['Science','Science','Maths','Maths','Civics','Civics'],
      'Student':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
     'Marks':[88,56,36,78,43,53]}

In [37]:
df=pd.DataFrame(data)
print(df)

   Subject  Student  Marks
0  Science      Sam     88
1  Science  Charlie     56
2    Maths      Amy     36
3    Maths  Vanessa     78
4   Civics     Carl     43
5   Civics    Sarah     53

In [38]:
## Grouping of Column names using groupby

In [40]:
bysub=df.groupby('Subject')
print(bysub.mean())

TypeError: agg function failed [how->mean,dtype->object]

In [39]:
byyear=df.groupby('Year')
print(byyear.sum())

         Student  Marks
Year
2019  SamCharlie    144
2020  AmyVanessa    114
2021   CarlSarah     96

In [ ]:
## Concating Dataframes
## 1) Concat 2) Merge 3) Join

In [28]:
class_a=pd.DataFrame({'A':[1,2,3,4],
                     'B':[5,6,7,8],
                     'C':[9,10,11,12],
                     'D':[13,14,15,16]},
                    index=['Ravi','Shyam','Saurav','Abhi'])
class_a

        A  B   C   D
Ravi    1  5   9  13
Shyam   2  6  10  14
Saurav  3  7  11  15
Abhi    4  8  12  16

In [32]:
class_b=pd.DataFrame({'A':[17, 18, 19, 20],
                     'B':[21, 22, 23, 24],
                     'C':[25, 26, 27, 28],
                     'D':[29, 30, 31, 32]},
                    index=['Shaan','Mahi','Viru','Mona'])
class_b

        A   B   C   D
Shaan  17  21  25  29
Mahi   18  22  26  30
Viru   19  23  27  31
Mona   20  24  28  32

In [33]:
## Concatanation

In [34]:
abc=pd.concat([class_a,class_b],axis=0)
print(abc)

         A   B   C   D
Ravi     1   5   9  13
Shyam    2   6  10  14
Saurav   3   7  11  15
Abhi     4   8  12  16
Shaan   17  21  25  29
Mahi    18  22  26  30
Viru    19  23  27  31
Mona    20  24  28  32

In [35]:
df.cat2=pd.concat([class_a,class_b],axis=1)
print(df.cat2)

          A    B     C     D     A     B     C     D
Ravi    1.0  5.0   9.0  13.0   NaN   NaN   NaN   NaN
Shyam   2.0  6.0  10.0  14.0   NaN   NaN   NaN   NaN
Saurav  3.0  7.0  11.0  15.0   NaN   NaN   NaN   NaN
Abhi    4.0  8.0  12.0  16.0   NaN   NaN   NaN   NaN
Shaan   NaN  NaN   NaN   NaN  17.0  21.0  25.0  29.0
Mahi    NaN  NaN   NaN   NaN  18.0  22.0  26.0  30.0
Viru    NaN  NaN   NaN   NaN  19.0  23.0  27.0  31.0
Mona    NaN  NaN   NaN   NaN  20.0  24.0  28.0  32.0

C:\Users\Dell\AppData\Local\Temp\ipykernel_5072\3931105206.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df.cat2=pd.concat([class_a,class_b],axis=1)

In [49]:
name=pd.DataFrame({'ID':[10,20,30,40,50,60,70],
                            'Name':['A','B','C','D','E','F','G']})

In [50]:
name

   ID Name
0  10    A
1  20    B
2  30    C
3  40    D
4  50    E
5  60    F
6  70    G

In [51]:
detail=pd.DataFrame({'ID':[10,20,30,40,50],
                            'Age':[36,34,20,28,37],
                            'Country':['Porugal','Argentina','England','France','India']})

In [52]:
detail

   ID  Age    Country
0  10   36    Porugal
1  20   34  Argentina
2  30   20    England
3  40   28     France
4  50   37      India

In [54]:
pd.merge(name,detail,on='ID')       ## Merges Data Column wise on the basis of ID

   ID Name  Age    Country
0  10    A   36    Porugal
1  20    B   34  Argentina
2  30    C   20    England
3  40    D   28     France
4  50    E   37      India

In [55]:
## JOIN

In [56]:
left=pd.DataFrame({'A':['A0','A1','A2'],
                  'B':['B0','B1','B2']},
                 index=['K0','K1','K2'])

In [57]:
right=pd.DataFrame({'C':['C0','C2','C3'],
                   'D':['D0','D2','D3']},
                  index=['K0','K2','K3'])

In [60]:
left               ## Prints the left dictionary

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [61]:
right            ## Prints the right dictionary

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [62]:
left.join(right)    ## Joins left dictionary with the right according to rows and columns

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [63]:
left.join(right,how='outer')       ## Prints the outer index also in the left dictionary
                                   ## K3 is the outer join in this case

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3